<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"367f47afbdee61ae971a3134c3121b4e9ca26f73e7741f3ad4e11c1d1c138462","plan_job_ref":"Job Validations on PR #68 at https://github.com/SelfOverflow/discord-bots/actions/runs/22866760279","plan_out_hash":"5609dc566bb186cbfd70aa6a325732ef2aa6fbfb0065790201e1598f01b62c65","plan_hash":"4af119aa2230df5a00cd625ffabb9299001b9158b3d123792b98fb386a5af474","plan_text_format":"diff","version":"2.0.0","closed":true} -->
Terraform plan in __./apps/bablu/terraform__
With variables: `image_tag = "a90b06aa33a2bdf0d56fe9ac8613a54dd95a9d7d"`
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.bot will be updated in-place
!~  resource "aws_ecs_service" "bot" {
        id                                 = "arn:aws:ecs:ap-south-1:613419461354:service/bablu-bot-cluster/bablu-bot-service"
        name                               = "bablu-bot-service"
        tags                               = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
!~      task_definition                    = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:9" -> (known after apply)
#        (15 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.bot must be replaced
-/+ resource "aws_ecs_task_definition" "bot" {
!~      arn                      = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task:9" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:ap-south-1:613419461354:task-definition/bablu-bot-task" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
!~                  image            = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:64b230add0611bb9a6c1169c7df34909894c5bd2" -> "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository:a90b06aa33a2bdf0d56fe9ac8613a54dd95a9d7d"
-                   mountPoints      = []
                    name             = "bot"
-                   portMappings     = []
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      enable_fault_injection   = false -> (known after apply)
!~      id                       = "**************" -> (known after apply)
!~      revision                 = 9 -> (known after apply)
        tags                     = {
            "Environment" = "mono"
            "ManagedBy"   = "terraform"
            "Project"     = "bablu-bot"
        }
#        (12 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Post merge deploy to production #43](https://github.com/SelfOverflow/discord-bots/actions/runs/22866836898)
<details><summary>Outputs</summary>

```hcl
ecr_repository_url     = "613419461354.dkr.ecr.ap-south-1.amazonaws.com/bablu-container-repository"
ecs_cluster_name       = "bablu-bot-cluster"
ecs_execution_role_arn = "arn:aws:iam::613419461354:role/bablu-bot-ecs-execution-role"
ecs_security_group     = "sg-0b82388ca3a1ccc0c"
ecs_task_role_arn      = "arn:aws:iam::613419461354:role/bablu-bot-ecs-task-role"
public_subnets         = [
    "subnet-098c041204c05f1ab",
    "subnet-06a6f4c66b4b20bf4",
]
vpc_id                 = "vpc-032c55070aacaa29e"
```
</details>